---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.SpotDimension
source: html/5d70c697-396a-cc67-2caf-5608f556a456.htm
---
# SpotDimension Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.